app/controllers/carts_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 26 Mar 2013 16:29:58 UTC +00:00], ["updated_at", Tue, 26 Mar 2013 16:29:58 UTC +00:00]]
---
  def create
    @cart = Cart.new(params[:cart])
    @row = current_row
    respond_to do |format|
      if @cart.save