app/controllers/cart_line_items_controller.rb

SELECT "cart_line_items".* FROM "cart_line_items"
---
  def index
    @cart_line_items = CartLineItem.all

SELECT "cart_line_items".* FROM "cart_line_items" WHERE "cart_line_items"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def show
    @cart_line_item = CartLineItem.find(params[:id])

SELECT "cart_line_items".* FROM "cart_line_items" WHERE "cart_line_items"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @cart_line_item = CartLineItem.find(params[:id])

SELECT "shapes".* FROM "shapes" WHERE "shapes"."id" = ? LIMIT 1  [["id", "207281424"]]
INSERT INTO "cart_line_items" ("cart_id", "created_at", "shape_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 980190963], ["created_at", Tue, 26 Mar 2013 16:29:57 UTC +00:00], ["shape_id", 207281424], ["updated_at", Tue, 26 Mar 2013 16:29:57 UTC +00:00]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 26 Mar 2013 16:29:57 UTC +00:00], ["updated_at", Tue, 26 Mar 2013 16:29:57 UTC +00:00]]
---
  def create
    #below line commented out just because it's not in agile p110
    #@cart_line_item = CartLineItem.new(params[:cart_line_item])
    @cart = current_cart
    @row = current_row
    shape = Shape.find(params[:shape_id])
    #below line replaced by the following from p116
    #@cart_line_item = @cart.cart_line_items.build
    @cart_line_item = @cart.add_shape(shape.id)
    #why the below line cannot find shape?  is it needed?
    @cart_line_item.shape = shape

    respond_to do |format|
      if @cart_line_item.save

SELECT "cart_line_items".* FROM "cart_line_items" WHERE "cart_line_items"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @cart_line_item = CartLineItem.find(params[:id])

SELECT "cart_line_items".* FROM "cart_line_items" WHERE "cart_line_items"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "cart_line_items" WHERE "cart_line_items"."id" = ?  [["id", 980190962]]
---
  def destroy
    @cart_line_item = CartLineItem.find(params[:id])
    @cart_line_item.destroy