app/controllers/grid_controller.rb

SELECT "shapes".* FROM "shapes" ORDER BY RANDOM() LIMIT 49
---
  def index
    @shapes = Shape.all(:order => 'RANDOM()', :limit => 49)