app/controllers/line_items_controller.rb

  def create
    #@line_item = LineItem.new(params[:line_item])
    @row = current_row
    @cart = current_cart
    shape = Shape.find(params[:shape_id])
    @line_item = @row.line_items.build
    @line_item.shape = shape
    #below from movies. necessary?
    #@line_item = @row.add_shape(shape.id)

    respond_to do |format|
      if @line_item.save
---
INSERT INTO "rows" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 15 Mar 2013 12:04:56 UTC +00:00], ["updated_at", Fri, 15 Mar 2013 12:04:56 UTC +00:00]]