app/controllers/rows_controller.rb

  def index
    @rows = Row.all
---
SELECT "rows".* FROM "rows"

  def show
    @row = Row.find(params[:id])
---
SELECT "rows".* FROM "rows" WHERE "rows"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @row = Row.find(params[:id])
---
SELECT "rows".* FROM "rows" WHERE "rows"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @row = Row.new(params[:row])
    @cart = current_cart

    respond_to do |format|
      if @row.save
---
INSERT INTO "rows" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 15 Mar 2013 12:04:57 UTC +00:00], ["updated_at", Fri, 15 Mar 2013 12:04:57 UTC +00:00]]

  def update
    @row = Row.find(params[:id])
---
SELECT "rows".* FROM "rows" WHERE "rows"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @row = current_row
    @row.destroy
---
DELETE FROM "rows" WHERE "rows"."id" = ?  [["id", 980190962]]