app/controllers/shapes_controller.rb

  def index
    @shapes = Shape.all
---
SELECT "shapes".* FROM "shapes"

  def show
    @shape = Shape.find(params[:id])
---
SELECT "shapes".* FROM "shapes" WHERE "shapes"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @shape = Shape.find(params[:id])
---
SELECT "shapes".* FROM "shapes" WHERE "shapes"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @shape = current_user.shapes.new(params[:shape])

    respond_to do |format|
      if @shape.save
---
INSERT INTO "shapes" ("created_at", "image_url", "lrg_image_url", "price", "shape_type", "text", "text_type", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @shape = Shape.find(params[:id])

    respond_to do |format|
      if @shape.update_attributes(params[:shape])
---
SELECT "shapes".* FROM "shapes" WHERE "shapes"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "shapes" SET "title" = 'Lorem Ipsum', "text" = 'Wibbles are fun!', "text_type" = 'fortune', "image_url" = 'lorem.jpg', "lrg_image_url" = 'lorem.jpg', "shape_type" = 'animal', "updated_at" = '2013-03-26 22:39:11.723273' WHERE "shapes"."id" = 980190962

  def destroy
    @shape = Shape.find(params[:id])
    @shape.destroy
---
SELECT "shapes".* FROM "shapes" WHERE "shapes"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "shapes" WHERE "shapes"."id" = ?  [["id", 980190962]]